In [8]:
import numpy as np
import pandas as pd

pandas는 크게 두 가지 자료 구조로 이루어짐 
1. Series
2. DataFrame

Serise는 모든 데이터 유형(정수, 실수, 문자 등)을 담을 수 있다.   
Serise 생성해보기

s = pd.Series(data, index=index, name=name)

In [10]:
a = pd.Series([4,5,-6,7])
a

0    4
1    5
2   -6
3    7
dtype: int64

딕셔너리로 만들기

In [13]:
dict_data = {'a':4,'b':5,'c':-6,'d':7}
series_data = pd.Series(dict_data)
series_data

a    4
b    5
c   -6
d    7
dtype: int64

In [15]:
dict_data1 = {'a':8,'b':9,'c':10}
d_d = pd.Series(dict_data1)
d_d

a     8
b     9
c    10
dtype: int64

리스트로 만들기

In [16]:
list_data = ['2023-02-03',3.14,'ABC',100,True]
l_d = pd.Series(list_data)
l_d

0    2023-02-03
1          3.14
2           ABC
3           100
4          True
dtype: object

In [21]:
list_data2 = ['230','33','12','popo']
l_d2 = pd.Series(list_data2)
l_d2

0     230
1      33
2      12
3    popo
dtype: object

# DataFrame
* 배열로 생성하는 법

In [22]:
sample_array = np.arange(5)
sample_array

array([0, 1, 2, 3, 4])

In [23]:
sample_df = pd.DataFrame({
    'col1' : sample_array,
    'col2' : sample_array*2,
    'col3' : ["a","b","c","d","e"]
})
sample_df

   col1  col2 col3
0     0     0    a
1     1     2    b
2     2     4    c
3     3     6    d
4     4     8    e

In [24]:
sample_df = pd.DataFrame({
    'col1' : sample_array+5,
    'col2' : sample_array*2,
    'col3' : ["a","b","c","d","e"]
})
sample_df

   col1  col2 col3
0     5     0    a
1     6     2    b
2     7     4    c
3     8     6    d
4     9     8    e

리스트로 만들기

In [47]:
df = pd.DataFrame([[80,90,100,70],[70,80,90,100]],
                  index=['달리기','점프'],
                  columns=['모모','츄츄','디디','루루'])
df

     모모  츄츄   디디   루루
달리기  80  90  100   70
점프   70  80   90  100

딕셔너리로 생성하기

In [48]:
data = {'score1' : [91,94,97,100], 'score2' : [100, 97, 94, 91]}
data

{'score1': [91, 94, 97, 100], 'score2': [100, 97, 94, 91]}

In [49]:
data = pd.DataFrame(data, index=['a','b','c','d'])
data

   score1  score2
a      91     100
b      94      97
c      97      94
d     100      91

In [41]:
sample_df.drop("col5", axis=1)

   col1  col2  col3  col4
0     5     0     1     1
1     6     2     1     1
2     7     4     1     1
3     8     6     1     1
4     9     8     1     1

데이터 변환
* pd.DataFrame.to_parquet()
* pd.DataFrame.to_csv()
* pd.DataFrame.to_excel()

컬럼 선택, 추가, 삭제

컬럼 추가

In [50]:
frame_add_col = pd.DataFrame(columns=['col1','col2','col3','col4'])
frame_add_col['col4'] = ['1', '2']

frame_add_col

  col1 col2 col3 col4
0  NaN  NaN  NaN    1
1  NaN  NaN  NaN    2

In [51]:
sample_df['col5'] = 1

sample_df

   col1  col2  col3  col4  col5
0     5     0     1     1     1
1     6     2     1     1     1
2     7     4     1     1     1
3     8     6     1     1     1
4     9     8     1     1     1